app/views/surveys/index.html.erb

SELECT COUNT(*) FROM "user_responses" WHERE "user_responses"."user_id" = $1  [["user_id", 2]]
---
  <div id="js--save-pref-button">
      <% if logged_in? && current_user.user_responses.count > 8  %>