app/controllers/itineraries_controller.rb

  def show
    if logged_in?
      @itinerary = Itinerary.find_by(id: params[:id])
---
SELECT  "itineraries".* FROM "itineraries" WHERE "itineraries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_event_attributes(y, itinerary, category)
      Activity.create!(
      name: y.name,
      time_start: y.time_start,
      event_site_url: y.event_site_url,
      tickets_url: y.tickets_url,
      cost: y.cost,
      cost_max: y.cost_max,
      image_url: y.image_url,
      display_address: y.display_address,
      latitude: y.latitude,
      longitude: y.longitude,
      itinerary_id: itinerary.id,
      category: category,
      version: "event"
    )
---
INSERT INTO "activities" ("name", "display_address", "time_start", "event_site_url", "tickets_url", "cost", "cost_max", "image_url", "latitude", "longitude", "version", "itinerary_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
INSERT INTO "itineraries" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 4], ["created_at", "2017-12-03 17:01:08.163819"], ["updated_at", "2017-12-03 17:01:08.163819"]]