app/controllers/preferences_controller.rb

INSERT INTO "preferences" ("user_id", "keyword", "categories", "is_necessary?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["keyword", "vegan"], ["categories", "vegan"], ["is_necessary?", "t"], ["created_at", "2017-12-03 15:29:22.288995"], ["updated_at", "2017-12-03 15:29:22.288995"]]
---
  def set_preferences
    Preference.create!(:user_id => current_user.id, :events_categories => [grab_restrictions], :business_categories => [grab_restrictions], :google_places_types => ['restaurant', 'cafe'], :keywords => ['restaurants'], :is_necessary? => true) if grab_restrictions != nil || grab_responses != "None"