app/controllers/surveys_controller.rb

  def index
    @questions = SurveyQuestion.page(params[:page]).per(1)
---
SELECT  "survey_questions".* FROM "survey_questions" ORDER BY "survey_questions"."created_at" ASC LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "survey_questions"