app/controllers/user_responses_controller.rb

  def create
   user_answer = params[:answer]
   question_id = params[:survey_question_id]
    @user_response = UserResponse.create!(response: user_answer, survey_question_id: question_id, :user_id => current_user.id)
---
INSERT INTO "user_responses" ("user_id", "survey_question_id", "response", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["survey_question_id", 3], ["response", "No, not much of a drinker these days"], ["created_at", "2017-12-03 04:51:37.193966"], ["updated_at", "2017-12-03 04:51:37.193966"]]